# Path Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ImageTypeOptions..::..Path Property
ImageTypeOptions Class See Also
---
The path of the file that specifies the image to be used.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2020
# Syntax
C#
---
```text
public string Path { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Path As String
	Get
```

Visual C++
---
```text
public:
property String^ Path {
	String^ get ();
}
```

# See Also
ImageTypeOptions Class
Autodesk.Revit.DB Namespace